{
    "createPlugin": "Create Plugin",
    "createCSPlugin": "Create Cloud Studio Plugin",
    "howToCreatePlugin": "How to create a Cloud Studio plugin?",
    "pluginName": "Plugin Name",
    "repoName": "Repo Name",
    "inputPluginName": "Give your plugin a resounding name",
    "inputRepoName": "Used to generate Tencent Cloud Dev Platform projects, only supports numbers, letters, underscores (_), and underscores (-)",
    "inputPluginDesc": "Briefly describe the role of this plugin, up to 255 characters",
    "viewPluginMarket": "View Plugin Market",
    "currentRelease": "Current Release",
    "releaseNote": "Release Note",
    "inputReleaseNote": "Please enter the feature record added or modified in this release.",
    "pushTip": "Make sure the remote repo of the current plugin exists before Publish, and the latest code has been pushed to the repo. ",
    "prePushTip": "Make sure the remote repo of the current plugin exists before Pre-Publish, and the latest code has been pushed to the repo. ",
    "prePublishTip": "Pre-Publish will package and install the latest code from the current repository into all of your workspaces, it will overwrite your officially published version, but will not be published to the plugin market.",
    "versionTip": "The new version must be higher than the old version",
    "creatingPlugin": "Creating plugin...",
    "hasPrePublish": "The plugin is pre-published and you can preview it in all your workspaces.",
    "cancelPrePublish": "Close Pre-Publish",
    "cannotPublishForAuditing": "The last release is under review and is temporarily unavailable",
    "cannotPublishForBuilding": "The last release is been building and is temporarily unavailable",
    "publishing": "Publishing...",
    "pluginSet": "Settings",
    "basicSet": "Basic Settings",
    "otherSet": "Other Settings",
    "deletePlugin": "Delete Plugin",
    "alsoDeleteWorkspace": "Also delete the workspace",
    "deletePluginTip1": "Remove the plugin while deleting the workspace, but not deleting the project (code repo). This operation is not recoverable. Confirm to delete the plugin?",
    "deletePluginTip2": "Remove the plugin without deleting the workspace and not deleting the project (code repo). This operation is not recoverable. Confirm to delete the plugin?",
    "officialPublish": "Publish",
    "prePublish": "Pre Publish",
    "versionHistory": "Version History",
    "publishTime": "Publish Time",
    "auditOpinion": "Audit Opinion",
    "noVersionHistory": "No versions history yet",
    "codeRepo": "Repository",
    "gameTip": "The Cloud Studio plugin development contest is in progress. If you are interested in the editor plugin, you can click the button below to participate in the contest. If your plugin is popular with developers, you will also receive a grand prize. ",
    "prePublishBuilding": "Your Pre-Publish is been building, please wait...",
    "searchPlugin": "Search Plugins",
    "userCount": " person rating",
    "published": "Published",
    "newVersion": "New Version",
    "nowPrePublish": "You are currently using a Pre-Publish version. ",
    "status0": "Your plugin has not been published yet and is not visible to the outside world. You can publish the plugin by clicking「Publish」below.",
    "status1": "Your plugin v{{version}} version is under review, usually 3-5 business days, during which you can't publish it, please be patient.",
    "status2": "Your plugin failed to be approved due to {{reason}}",
    "status3": "Your plugin v{{version}} version is approved and is being built...",
    "status4": "Your plugin v{{version}} failed to build. Please modify the code and republish it.",
    "status4Click": "View build logs",
    "status4Desc": "Your plugin v{{version}} failed to build and the logs are as follows:",
    "status5": "Your plugin v{{version}} version was built successfully, and has been released to the plugin market, click",
    "status5Click": " here ",
    "status5After": "to preview.",
    "state0": "Never Published",
    "state1": "Pending",
    "state2": "Audit failure",
    "state3": "Building",
    "state4": "Build failure",
    "state5": "Published",
    "preStat0": "There are currently no pre-publish, you can ",
    "preStat0Click": "Pre-Publish a version",
    "preStat0Action": "Pre Publish",
    "preStat0Desc": "There are currently no pre-publish, you can pre-publish a version by clicking the button below. The pre-publish version does not affect the official release.",
    "preStat1": "The last pre-publish is been building, please be patient...",
    "preStat2": "Currently in pre-publish status, if you need to use the official version, you can ",
    "preStat2Click": "close Pre-Publish",
    "preStat2Action": "Close Pre-Publish",
    "preStat2Desc": "Currently in pre-publish status, you can close the pre-publish by clicking the button below.",
    "preStat3": "The last Pre-Publish build failed. ",
    "preStat3Click": "See details.",
    "preStat3Desc": "The last pre-publish build failed, you can modify the code and re-publish it. The build log is as follows:",
    "preStat3Action": "Pre-Publish Again"
}
