{
    "createWorkspace": "Create Workspace",
    "creatingWS": "Creating workspace...",
    "myWorkspace": "My Workspaces",
    "workspaceName": "Workspace Name",
    "projectName": "Project Name",
    "otherGitRepo": "Other Git Repos",
    "noRemoteRepo": "No Source",
    "welcomeToCS": "Welcome to Cloud Studio!",
    "welcomeLineOne": "Cloud Studio is a browser-based integrated development environment (IDE). Developers can create workspaces in Cloud Studio to store their own project code, install the required environment, and run and compile their own projects.",
    "wsExisted": "Workspace {{ws}} already existed",
    "oldCoding": "Original Coding.net",
    "limitTip": "Up to {{limit}} workspace limits, no more creations",
    "inputProjectName": "Fill in the project name",
    "inputWSName": "Fill in the workspace name",
    "inputWSDesc": "Describe this workspace in one sentence",
    "inputGitUrl": "Fill in the Git repository address",
    "wsTip": "You can create {{limit}} workspaces in total, but run only one at a time. ",
    "noWSTip": "You can create a workspace to start your work here.",
    "deletedWSTip": "After deleting, the project will be automatically kept for one day, and you can recover it again during the period, otherwise it will be permanently deleted.",
    "sshTip": "Currently, Cloud Studio import external projects only support SSH protocol. Please add the following SSH key (click anywhere in the box below to copy) to the list of public keys imported into the source Git repository. ",
    "syncTip": "Syncing your project on the Tencent Cloud Dev Platform. If you don't find the item you want, you can wait for the sync to complete and choose again.",
    "envTip": "Cloud Studio has built-in common environments such as Node.js, Python, Java, etc. to help you get rid of the cumbersome configuration and get to the development quickly. The operating environment also supports one-click switching, saving and recovery.",
    "stopNotice": "Please confirm whether to stop this workspace?",
    "restoreNotice": "Please confirm whether to restore?",
    "deleteNotice": "After the deletion, the workspace automatically reserves for you for a day, before which you can resume at any time, otherwise it will be permanently deleted. Please confirm whether to delete?",
    "quitNotice": "Please confirm whether to quit collaboration？",
    "hasWSOpendNotice": "You have an open workspace, if you want to open another, click the stop button below.",
    "existingProject": "Existing Project",
    "templateProject": "Create Project by template",
    "noProject": "This is empty, please click the 'Sync' button in the upper right corner to sync the CODING project list, or click 'Create Project by template' above to create a new project.",
    "collaborativeWorkspace": "Collaborative workspaces",
    "collaborativeWorkspaceTip": "Workspaces that are collaborative are not subject to restrictions.",
    "colStat1": "Collaboration Requesting",
    "colStat2": "Collaborating",
    "colStat3": "Collaboration Rejected"
}
